_posts/2022-01-05-boj-14725.html
---
title: BOJ 14725 개미굴
tags: dfs Trie
---

<div id="outline-container-org5c8769b" class="outline-2">
<h2 id="org5c8769b">BOJ 14725 개미굴</h2>
<div class="outline-text-2" id="text-org5c8769b">
<ul class="org-ul">
<li>string을 key로 하는 Trie를 STL로 구성하기</li>
<li>STL map은 key가 정렬된 순서로 추가된다. -&gt; 단어 알파벳 오름차순</li>
</ul>
</div>
</div>

<div id="outline-container-org906159f" class="outline-2">
<h2 id="org906159f">접근하기</h2>
<div class="outline-text-2" id="text-org906159f">
<pre class="example">
map&lt;string, Node&gt; Node에 재귀적인 형태로 추가
단어가 추가되는 Trie라고 생각하기
</pre>
</div>
</div>

<div id="outline-container-org260387e" class="outline-2">
<h2 id="org260387e">코드 - STL map 이용</h2>
<div class="outline-text-2" id="text-org260387e">
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #729fcf;">#include</span> <span style="color: #ad7fa8; font-style: italic;">&lt;bits/stdc++.h&gt;</span>
<span style="color: #729fcf; font-weight: bold;">using</span> <span style="color: #729fcf; font-weight: bold;">namespace</span> <span style="color: #8ae234;">std</span>;

<span style="color: #729fcf; font-weight: bold;">typedef</span> <span style="color: #729fcf; font-weight: bold;">struct</span> <span style="color: #8ae234; font-weight: bold;">Node</span>{
        <span style="color: #8ae234; font-weight: bold;">map</span>&lt;<span style="color: #8ae234; font-weight: bold;">string</span>, <span style="color: #8ae234; font-weight: bold;">Node</span>&gt; <span style="color: #ff6347;">mp</span>;
} <span style="color: #8ae234; font-weight: bold;">Node</span>;

<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">T</span>, <span style="color: #ff6347;">N</span>;
<span style="color: #8ae234; font-weight: bold;">Node</span> <span style="color: #ff6347;">root</span>;

<span style="color: #8ae234; font-weight: bold;">void</span> <span style="color: #edd400; font-weight: bold;">dfs</span>(<span style="color: #8ae234; font-weight: bold;">Node</span>&amp; <span style="color: #ff6347;">cur</span>, <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">idx</span>)
{
        <span style="color: #729fcf; font-weight: bold;">for</span>(<span style="color: #729fcf; font-weight: bold;">auto</span>&amp; <span style="color: #ff6347;">o</span> : cur.mp) {  <span style="color: #888a85;">// </span><span style="color: #888a85;">map - key&#47196; &#51221;&#47148;&#46104;&#50612; &#51080;&#51020;</span>
                <span style="color: #729fcf; font-weight: bold;">for</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">i</span>=0;i&lt;idx;i++) {
                        printf(<span style="color: #ad7fa8; font-style: italic;">"--"</span>);
                }
                cout &lt;&lt; o.first &lt;&lt; <span style="color: #ad7fa8; font-style: italic;">'\n'</span>;
                dfs(o.second, idx+1);
        }
}

<span style="color: #8ae234; font-weight: bold;">void</span> <span style="color: #edd400; font-weight: bold;">insert</span>(<span style="color: #8ae234; font-weight: bold;">Node</span>&amp; <span style="color: #ff6347;">cur</span>, <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">idx</span>, <span style="color: #8ae234; font-weight: bold;">vector</span>&lt;<span style="color: #8ae234; font-weight: bold;">string</span>&gt;&amp; <span style="color: #ff6347;">a</span>, <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">size</span>)
{
        <span style="color: #729fcf; font-weight: bold;">if</span> (idx == size) <span style="color: #729fcf; font-weight: bold;">return</span>;
        <span style="color: #729fcf; font-weight: bold;">if</span> (cur.mp.count(a[idx]) == 0) {
                cur.mp[a[idx]] = Node();   <span style="color: #888a85;">// </span><span style="color: #888a85;">&#49373;&#49457;&#51088;&#47196; &#44061;&#52404; &#52628;&#44032;</span>
        }
        insert(cur.mp[a[idx]], idx+1, a, size);
}

<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #edd400; font-weight: bold;">main</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">argc</span>, <span style="color: #8ae234; font-weight: bold;">char</span>* <span style="color: #ff6347;">argv</span>[])
{
        scanf(<span style="color: #ad7fa8; font-style: italic;">"%d"</span>, &amp;T);
        <span style="color: #729fcf; font-weight: bold;">for</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">i</span>=0;i&lt;T;i++) {
                scanf(<span style="color: #ad7fa8; font-style: italic;">"%d"</span>, &amp;N);
                <span style="color: #8ae234; font-weight: bold;">vector</span>&lt;<span style="color: #8ae234; font-weight: bold;">string</span>&gt; <span style="color: #ff6347;">a</span>(N);
                <span style="color: #729fcf; font-weight: bold;">for</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">j</span>=0;j&lt;N;j++) {
                        cin &gt;&gt; a[j];
                }
                insert(root, 0, a, N);
        }
        dfs(root, 0);
        <span style="color: #729fcf; font-weight: bold;">return</span> 0;
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org9be903d" class="outline-2">
<h2 id="org9be903d">코드 - LCRS tree 구조 이용</h2>
</div>

<div id="outline-container-orgad419e9" class="outline-2">
<h2 id="orgad419e9">문제 링크</h2>
<div class="outline-text-2" id="text-orgad419e9">
<ul class="org-ul">
<li><a href="https://www.acmicpc.net/problem/14725">https://www.acmicpc.net/problem/14725</a></li>
</ul>
</div>
</div>

<div id="outline-container-org1441c51" class="outline-2">
<h2 id="org1441c51">풀이 참고</h2>
<div class="outline-text-2" id="text-org1441c51">
<ul class="org-ul">
<li><a href="https://justicehui.github.io/ps/2019/08/27/BOJ14725/">https://justicehui.github.io/ps/2019/08/27/BOJ14725/</a></li>
</ul>
</div>
</div>
